Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها فتعالين أمتعكن وأسرحكن سراحا جميلا
en: O Prophet (Muhammad صلى الله عليه وسلم)! Say to your wives: "If you desire the life of this world, and its glitter, then come! I will make a provision for you and set you free in a handsome manner (divorce).

source: وإن كنتن تردن الله ورسوله والدار الآخرة فإن الله أعد للمحسنات منكن أجرا عظيما
en: "But if you desire Allah and His Messenger, and the home of the Hereafter, then verily, Allah has prepared for Al-Muhsinat (good-doers) amongst you an enormous reward."

source: يا نساء النبي من يأت منكن بفاحشة مبينة يضاعف لها العذاب ضعفين وكان ذلك على الله يسيرا
en: O wives of the Prophet! Whoever of you commits an open illegal sexual intercourse, the torment for her will be doubled, and that is ever easy for Allah.

source: ومن يقنت منكن لله ورسوله وتعمل صالحا نؤتها أجرها مرتين وأعتدنا لها رزقا كريما
en: And whosoever of you is obedient to Allah and His Messenger (صلى الله عليه وسلم), and does righteous good deeds, We shall give her, her reward twice over, and We have prepared for her Rizq Karim (a noble provision - Paradise).

source: يا نساء النبي لستن كأحد من النساء إن اتقيتن فلا تخضعن بالقول فيطمع الذي في قلبه مرض وقلن قولا معروفا
en: O wives of the Prophet! You are not like any other women. If you keep your duty (to Allah), then be not soft in speech, lest he in whose heart is a disease (of hypocrisy, or evil desire for adultery) should be moved with desire, but speak in an honourable manner.

source: وقرن في بيوتكن ولا تبرجن تبرج الجاهلية الأولى وأقمن الصلاة وآتين الزكاة وأطعن الله ورسوله إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا
en: And stay in your houses, and do not display yourselves like that of the times of ignorance, and perform As-Salat (Iqamat-as-Salat), and give Zakat and obey Allah and His Messenger. Allah wishes only to remove Ar-Rijs (evil deeds and sins) from you, O members of the family (of the Prophet صلى الله عليه وسلم), and to purify you with a thorough purification.

source: واذكرن ما يتلى في بيوتكن من آيات الله والحكمة إن الله كان لطيفا خبيرا
en: And remember (O you the members of the Prophet's family, the Graces of your Lord), that which is recited in your houses of the Verses of Allah and Al-Hikmah (i.e. Prophet's Sunnah - legal ways, so give your thanks to Allah and glorify His Praises for this Qur'an and the Sunnah ). Verily, Allah is Ever Most Courteous, Well-Acquainted with all things.

source: إن المسلمين والمسلمات والمؤمنين والمؤمنات والقانتين والقانتات والصادقين والصادقات والصابرين والصابرات والخاشعين والخاشعات والمتصدقين والمتصدقات والصائمين والصائمات والحافظين فروجهم والحافظات والذاكرين الله كثيرا والذاكرات أعد الله لهم مغفرة وأجرا عظيما
en: Verily, the Muslims (those who submit to Allah in Islam) men and women, the believers men and women (who believe in Islamic Monotheism), the men and the women who are obedient (to Allah), the men and women who are truthful (in their speech and deeds), the men and the women who are patient (in performing all the duties which Allah has ordered and in abstaining from all that Allah has forbidden), the men and the women who are humble (before their Lord - Allah), the men and the women who give Sadaqat (i.e. Zakat, and alms), the men and the women who observe Saum (fast) (the obligatory fasting during the month of Ramadan, and the optional Nawafil fasting), the men and the women who guard their chastity (from illegal sexual acts) and the men and the women who remember Allah much with their hearts and tongues Allah has prepared for them forgiveness and a great reward (i.e. Paradise).

source: وما كان لمؤمن ولا مؤمنة إذا قضى الله ورسوله أمرا أن يكون لهم الخيرة من أمرهم ومن يعص الله ورسوله فقد ضل ضلالا مبينا
en: It is not for a believer, man or woman, when Allah and His Messenger have decreed a matter that they should have any option in their decision. And whoever disobeys Allah and His Messenger, he has indeed strayed into a plain error.

source: وإذ تقول للذي أنعم الله عليه وأنعمت عليه أمسك عليك زوجك واتق الله وتخفي في نفسك ما الله مبديه وتخشى الناس والله أحق أن تخشاه فلما قضى زيد منها وطرا زوجناكها لكي لا يكون على المؤمنين حرج في أزواج أدعيائهم إذا قضوا منهن وطرا وكان أمر الله مفعولا
en: And (remember) when you said to him (Zaid bin Harithah رضي الله عنه - the freed-slave of the Prophet صلى الله عليه وسلم) on whom Allah has bestowed Grace (by guiding him to Islam) and you (O Muhammad صلى الله عليه وسلم too) have done favour (by manumitting him): "Keep your wife to yourself, and fear Allah." But you did hide in yourself (i.e. what Allah has already made known to you that He will give her to you in marriage) that which Allah will make manifest, you did fear the people (i.e., their saying that Muhammad صلى الله عليه وسلم married the divorced wife of his manumitted slave) whereas Allah had a better right that you should fear Him. So when Zaid had accomplished his desire from her (i.e. divorced her), We gave her to you in marriage, so that (in future) there may be no difficulty to the believers in respect of (the marriage of) the wives of their adopted sons when the latter have no desire to keep them (i.e. they have divorced them). And Allah's Command must be fulfilled.

source: ما كان على النبي من حرج فيما فرض الله له سنة الله في الذين خلوا من قبل وكان أمر الله قدرا مقدورا
en: There is no blame on the Prophet (صلى الله عليه وسلم) in that which Allah has made legal for him. That has been Allah's Way with those who have passed away of (the Prophets of) old. And the Command of Allah is a decree determined.

source: الذين يبلغون رسالات الله ويخشونه ولا يخشون أحدا إلا الله وكفى بالله حسيبا
en: Those who convey the Message of Allah and fear Him, and fear none save Allah. And Sufficient is Allah as a Reckoner.

source: ما كان محمد أبا أحد من رجالكم ولكن رسول الله وخاتم النبيين وكان الله بكل شيء عليما
en: Muhammad (صلى الله عليه وسلم) is not the father of any of your men, but he is the Messenger of Allah and the last (end) of the Prophets. And Allah is Ever All-Aware of everything.

source: يا أيها الذين آمنوا اذكروا الله ذكرا كثيرا
en: O you who believe! Remember Allah with much remembrance.

source: وسبحوه بكرة وأصيلا
en: And glorify His Praises morning and afternoon [the early morning (Fajr) and 'Asr prayers].

source: هو الذي يصلي عليكم وملائكته ليخرجكم من الظلمات إلى النور وكان بالمؤمنين رحيما
en: He it is Who sends Salat (His blessings) on you, and His angels too (ask Allah to bless and forgive you), that He may bring you out from darkness (of disbelief and polytheism) into light (of Belief and Islamic Monotheism). And He is Ever Most Merciful to the believers.

source: تحيتهم يوم يلقونه سلام وأعد لهم أجرا كريما
en: Their greeting on the Day they shall meet Him will be "Salam Peace (i.e. the angels will say to them: Salamun 'Alaikum)!" And He has prepared for them a generous reward (i.e. Paradise).

source: يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا
en: O Prophet (Muhammad صلى الله عليه وسلم)! Verily, We have sent you as witness, and a bearer of glad tidings, and a warner,

source: وداعيا إلى الله بإذنه وسراجا منيرا
en: And as one who invites to Allah [Islamic Monotheism, i.e. to worship none but Allah (Alone)] by His Leave, and as a lamp spreading light (through your instructions from the Qur'an and the Sunnah - the legal ways of the Prophet صلى الله عليه وسلم ).

source: وبشر المؤمنين بأن لهم من الله فضلا كبيرا
en: And announce to the believers (in the Oneness of Allah and in His Messenger Muhammad صلى الله عليه وسلم) the glad tidings, that they will have from Allah a Great Bounty.

source: ولا تطع الكافرين والمنافقين ودع أذاهم وتوكل على الله وكفى بالله وكيلا
en: And obey not the disbelievers and the hypocrites, and harm them not (in revenge for their harming you till you are ordered). And put your trust in Allah, and Sufficient is Allah as a Wakil (Trustee, or Disposer of affairs). [Tafsir Al-Qurtubi]

source: يا أيها الذين آمنوا إذا نكحتم المؤمنات ثم طلقتموهن من قبل أن تمسوهن فما لكم عليهن من عدة تعتدونها فمتعوهن وسرحوهن سراحا جميلا
en: O you who believe! When you marry believing women, and then divorce them before you have sexual intercourse with them, no 'Iddah [divorce prescribed period, see (V.65:4)] have you to count in respect of them. So give them a present, and set them free (i.e. divorce), in a handsome manner.

source: يا أيها النبي إنا أحللنا لك أزواجك اللاتي آتيت أجورهن وما ملكت يمينك مما أفاء الله عليك وبنات عمك وبنات عماتك وبنات خالك وبنات خالاتك اللاتي هاجرن معك وامرأة مؤمنة إن وهبت نفسها للنبي إن أراد النبي أن يستنكحها خالصة لك من دون المؤمنين قد علمنا ما فرضنا عليهم في أزواجهم وما ملكت أيمانهم لكيلا يكون عليك حرج وكان الله غفورا رحيما
en: O Prophet (Muhammad صلى الله عليه وسلم)! Verily, We have made lawful to you your wives, to whom you have paid their Mahr (bridal-money given by the husband to his wife at the time of marriage), and those (slaves) whom your right hand possesses - whom Allah has given to you, and the daughters of your 'Amm (paternal uncles) and the daughters of your 'Ammat (paternal aunts) and the daughters of your Khal (maternal uncles) and the daughters of your Khalat (maternal aunts) who migrated (from Makkah) with you, and a believing woman if she offers herself to the Prophet, and the Prophet wishes to marry her - a privilege for you only, not for the (rest of) the believers. Indeed We know what We have enjoined upon them about their wives and those (slaves) whom their right hands possess, in order that there should be no difficulty on you. And Allah is Ever Oft-Forgiving, Most Merciful.

source: ترجي من تشاء منهن وتؤوي إليك من تشاء ومن ابتغيت ممن عزلت فلا جناح عليك ذلك أدنى أن تقر أعينهن ولا يحزن ويرضين بما آتيتهن كلهن والله يعلم ما في قلوبكم وكان الله عليما حليما
en: You (O Muhammad صلى الله عليه وسلم) can postpone (the turn of) whom you will of them (your wives), and you may receive whom you will. And whomsoever you desire of those whom you have set aside (her turn temporarily), it is no sin on you (to receive her again): that is better that they may be comforted and not grieved, and may all be pleased with what you give them. Allah knows what is in your hearts. And Allah is Ever All-Knowing, Most Forbearing.

source: لا يحل لك النساء من بعد ولا أن تبدل بهن من أزواج ولو أعجبك حسنهن إلا ما ملكت يمينك وكان الله على كل شيء رقيبا
en: It is not lawful for you (to marry other) women after this, nor to change them for other wives even though their beauty attracts you, except those (slaves) whom your right hand possesses. And Allah is Ever a Watcher over all things.

source: يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه ولكن إذا دعيتم فادخلوا فإذا طعمتم فانتشروا ولا مستأنسين لحديث إن ذلكم كان يؤذي النبي فيستحيي منكم والله لا يستحيي من الحق وإذا سألتموهن متاعا فاسألوهن من وراء حجاب ذلكم أطهر لقلوبكم وقلوبهن وما كان لكم أن تؤذوا رسول الله ولا أن تنكحوا أزواجه من بعده أبدا إن ذلكم كان عند الله عظيما
en: O you who believe! Enter not the Prophet's houses, unless permission is given to you for a meal, (and then) not (so early as) to wait for its preparation. But when you are invited, enter, and when you have taken your meal, disperse without sitting for a talk. Verily, such (behaviour) annoys the Prophet, and he is shy of (asking) you (to go); but Allah is not shy of (telling you) the truth. And when you ask (his wives) for anything you want, ask them from behind a screen: that is purer for your hearts and for their hearts. And it is not (right) for you that you should annoy Allah's Messenger, nor that you should ever marry his wives after him (his death). Verily, with Allah that shall be an enormity.

source: إن تبدوا شيئا أو تخفوه فإن الله كان بكل شيء عليما
en: Whether you reveal anything or conceal it, verily, Allah is Ever All-Knower of everything.

source: لا جناح عليهن في آبائهن ولا أبنائهن ولا إخوانهن ولا أبناء إخوانهن ولا أبناء أخواتهن ولا نسائهن ولا ما ملكت أيمانهن واتقين الله إن الله كان على كل شيء شهيدا
en: It is no sin on them (the Prophet's wives, if they appear unveiled) before their fathers, or their sons, or their brothers, or their brother's sons, or the sons of their sisters, or their own (believing) women, or their (female) slaves. And (O ladies), fear (keep your duty to) Allah. Verily, Allah is Ever All-Witness over everything.

source: إن الله وملائكته يصلون على النبي يا أيها الذين آمنوا صلوا عليه وسلموا تسليما
en: Allah sends His Salat (Graces, Honours, Blessings, Mercy) on the Prophet (Muhammad صلى الله عليه وسلم), and also His angels (ask Allah to bless and forgive him). O you who believe! Send your Salat on (ask Allah to bless) him (Muhammad صلى الله عليه وسلم), and (you should) greet (salute) him with the Islamic way of greeting (salutation i.e. As-Salamu 'Alaikum ).

source: إن الذين يؤذون الله ورسوله لعنهم الله في الدنيا والآخرة وأعد لهم عذابا مهينا
en: Verily, those who annoy Allah and His Messenger (صلى الله عليه وسلم) Allah has cursed them in this world, and in the Hereafter, and has prepared for them a humiliating torment.

source: والذين يؤذون المؤمنين والمؤمنات بغير ما اكتسبوا فقد احتملوا بهتانا وإثما مبينا
en: And those who annoy believing men and women undeservedly, they bear (on themselves) the crime of slander and plain sin.

source: يا أيها النبي قل لأزواجك وبناتك ونساء المؤمنين يدنين عليهن من جلابيبهن ذلك أدنى أن يعرفن فلا يؤذين وكان الله غفورا رحيما
en: O Prophet! Tell your wives and your daughters and the women of the believers to draw their cloaks (veils) all over their bodies (i.e. screen themselves completely except the eyes or one eye to see the way). That will be better, that they should be known (as free respectable women) so as not to be annoyed. And Allah is Ever Oft-Forgiving, Most Merciful.

source: لئن لم ينته المنافقون والذين في قلوبهم مرض والمرجفون في المدينة لنغرينك بهم ثم لا يجاورونك فيها إلا قليلا
en: If the hypocrites, and those in whose hearts is a disease (evil desire for illegal sex), and those who spread false news among the people in Al-Madinah stop not, We shall certainly let you overpower them: then they will not be able to stay in it as your neighbours but a little while.

source: ملعونين أينما ثقفوا أخذوا وقتلوا تقتيلا
en: Accursed, they shall be seized wherever found, and killed with a (terrible) slaughter.

source: سنة الله في الذين خلوا من قبل ولن تجد لسنة الله تبديلا
en: That was the Way of Allah in the case of those who passed away of old: and you will not find any change in the Way of Allah.

source: يسألك الناس عن الساعة قل إنما علمها عند الله وما يدريك لعل الساعة تكون قريبا
en: People ask you concerning the Hour, say: "The knowledge of it is with Allah only. What do you know? It may be that the Hour is near!"

source: إن الله لعن الكافرين وأعد لهم سعيرا
en: Verily, Allah has cursed the disbelievers, and has prepared for them a flaming Fire (Hell).

source: خالدين فيها أبدا لا يجدون وليا ولا نصيرا
en: Wherein they will abide for ever, and they will find neither a Wali (a protector) nor a helper.

source: يوم تقلب وجوههم في النار يقولون يا ليتنا أطعنا الله وأطعنا الرسولا
en: On the Day when their faces will be turned over in the Fire, they will say: "Oh, would that we had obeyed Allah and obeyed the Messenger (Muhammad صلى الله عليه وسلم)."

source: وقالوا ربنا إنا أطعنا سادتنا وكبراءنا فأضلونا السبيلا
en: And they will say: "Our Lord! Verily, we obeyed our chiefs and our great ones, and they misled us from the (Right) Way.

source: ربنا آتهم ضعفين من العذاب والعنهم لعنا كبيرا
en: "Our Lord! Give them double torment and curse them with a mighty curse!"

source: يا أيها الذين آمنوا لا تكونوا كالذين آذوا موسى فبرأه الله مما قالوا وكان عند الله وجيها
en: O you who believe! Be not like those who annoyed Musa (Moses), but Allah cleared him of that which they alleged, and he was honourable before Allah.

source: يا أيها الذين آمنوا اتقوا الله وقولوا قولا سديدا
en: O you who believe! Keep your duty to Allah and fear Him, and speak (always) the truth.

source: يصلح لكم أعمالكم ويغفر لكم ذنوبكم ومن يطع الله ورسوله فقد فاز فوزا عظيما
en: He will direct you to do righteous good deeds and will forgive you your sins. And whosoever obeys Allah and His Messenger (صلى الله عليه وسلم), he has indeed achieved a great achievement (i.e. he will be saved from the Hell-fire and will be admitted to Paradise).

source: إنا عرضنا الأمانة على السماوات والأرض والجبال فأبين أن يحملنها وأشفقن منها وحملها الإنسان إنه كان ظلوما جهولا
en: Truly, We did offer Al-Amanah (the trust or moral responsibility or honesty and all the duties which Allah has ordained) to the heavens and the earth, and the mountains, but they declined to bear it and were afraid of it (i.e. afraid of Allah's Torment). But man bore it. Verily, he was unjust (to himself) and ignorant (of its results).

source: ليعذب الله المنافقين والمنافقات والمشركين والمشركات ويتوب الله على المؤمنين والمؤمنات وكان الله غفورا رحيما
en: So that Allah will punish the hypocrites, men and women, and the men and women who are Al-Mushrikun (polytheists, idolaters, pagans, disbelievers, in the Oneness of Allah, and His Messenger Muhammad صلى الله عليه وسلم). And Allah will pardon (accept the repentance of) the true believers of the Islamic Monotheism, men and women. And Allah is Ever Oft-Forgiving, Most Merciful.

source: الحمد لله الذي له ما في السماوات وما في الأرض وله الحمد في الآخرة وهو الحكيم الخبير
en: All the praises and thanks be to Allah, to Whom belongs all that is in the heavens and all that is in the earth. His is all the praises and thanks in the Hereafter, and He is the All-Wise, the All-Aware.

source: يعلم ما يلج في الأرض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو الرحيم الغفور
en: He knows that which goes into the earth and that which comes forth from it, and that which descends from the heaven and that which ascends to it. And He is the Most Merciful, the Oft-Forgiving.

source: وقال الذين كفروا لا تأتينا الساعة قل بلى وربي لتأتينكم عالم الغيب لا يعزب عنه مثقال ذرة في السماوات ولا في الأرض ولا أصغر من ذلك ولا أكبر إلا في كتاب مبين
en: Those who disbelieve say: "The Hour will not come to us." Say: "Yes, by my Lord, the All-Knower of the Unseen, it will come to you; not even the weight of an atom (or a small ant) or less than that or greater escapes His Knowledge in the heavens or in the earth but it is in a Clear Book (Al-Lauh Al-Mahfuz).

source: ليجزي الذين آمنوا وعملوا الصالحات أولئك لهم مغفرة ورزق كريم
en: That He may recompense those who believe (in the Oneness of Allah - Islamic Monotheism) and do righteous good deeds. Those, theirs is forgiveness and Rizq Karim (generous provision, i.e. Paradise).

source: والذين سعوا في آياتنا معاجزين أولئك لهم عذاب من رجز أليم
en: But those who strive against Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) to frustrate them - those, for them will be a severe painful torment.

source: ويرى الذين أوتوا العلم الذي أنزل إليك من ربك هو الحق ويهدي إلى صراط العزيز الحميد
en: And those who have been given knowledge see that what is revealed to you (O Muhammad صلى الله عليه وسلم) from your Lord is the truth, and that it guides to the Path of the Exalted in Might, Owner of all praise.

source: وقال الذين كفروا هل ندلكم على رجل ينبئكم إذا مزقتم كل ممزق إنكم لفي خلق جديد
en: Those who disbelieve say: "Shall we direct you to a man (Muhammad صلى الله عليه وسلم) who will tell you (that) when you have become fully disintegrated into dust with full dispersion, then you will be created (again) anew?"

source: أفترى على الله كذبا أم به جنة بل الذين لا يؤمنون بالآخرة في العذاب والضلال البعيد
en: Has he (Muhammad صلى الله عليه وسلم) invented a lie against Allah, or is there a madness in him? Nay, but those who disbelieve in the Hereafter are (themselves) in a torment, and in far error.

source: أفلم يروا إلى ما بين أيديهم وما خلفهم من السماء والأرض إن نشأ نخسف بهم الأرض أو نسقط عليهم كسفا من السماء إن في ذلك لآية لكل عبد منيب
en: See they not what is before them and what is behind them, of the heaven and the earth? If We will, We shall sink the earth with them, or cause a piece of the heaven to fall upon them. Verily, in this is a sign for every slave who turns to Allah in repentance (i.e. the one who believes in the Oneness of Allah and performs deeds of His obedience and always begs His Pardon).

source: ولقد آتينا داوود منا فضلا يا جبال أوبي معه والطير وألنا له الحديد
en: And indeed We bestowed grace on Dawud (David) from Us (saying): "O you mountains. Glorify (Allah) with him! And you birds (also)! And We made the iron soft for him."

source: أن اعمل سابغات وقدر في السرد واعملوا صالحا إني بما تعملون بصير
en: Saying: "Make you perfect coats of mail, and balance well the rings of chain armour, and work you (men) righteousness. Truly, I am All-Seer of what you do."

source: ولسليمان الريح غدوها شهر ورواحها شهر وأسلنا له عين القطر ومن الجن من يعمل بين يديه بإذن ربه ومن يزغ منهم عن أمرنا نذقه من عذاب السعير
en: And to Solomon (We subjected) the wind, its morning (stride from sunrise till midnoon) was a month's (journey), and its afternoon (stride from the midday decline of the sun to sunset) was a month's (journey i.e. in one day he could travel two months' (journey). And We caused a fount of (molten) brass to flow for him, and there were jinn that worked in front of him, by the Leave of his Lord. And whosoever of them turned aside from Our Command, We shall cause him to taste of the torment of the blazing Fire.

source: يعملون له ما يشاء من محاريب وتماثيل وجفان كالجواب وقدور راسيات اعملوا آل داوود شكرا وقليل من عبادي الشكور
en: They worked for him as he desired, (making) high rooms, images, basins as large as reservoirs, and (cooking) cauldrons fixed (in their places). "Work you, O family of Dawud (David), with thanks!" But few of My slaves are grateful.

source: فلما قضينا عليه الموت ما دلهم على موته إلا دابة الأرض تأكل منسأته فلما خر تبينت الجن أن لو كانوا يعلمون الغيب ما لبثوا في العذاب المهين
en: Then when We decreed death for him [Sulaiman (Solomon)], nothing informed them (jinn) of his death except a little worm of the earth, which kept (slowly) gnawing away at his stick. So when he fell down, the jinn saw clearly that if they had known the Unseen, they would not have stayed in the humiliating torment.

source: لقد كان لسبإ في مسكنهم آية جنتان عن يمين وشمال كلوا من رزق ربكم واشكروا له بلدة طيبة ورب غفور
en: Indeed there was for Saba' (Sheba) a sign in their dwelling-place - two gardens on the right hand and on the left; (and it was said to them:) "Eat of the provision of your Lord, and be grateful to Him." A fair land and an Oft-Forgiving Lord!

source: فأعرضوا فأرسلنا عليهم سيل العرم وبدلناهم بجنتيهم جنتين ذواتي أكل خمط وأثل وشيء من سدر قليل
en: But they turned away (from the obedience of Allah), so We sent against them Sail Al-'Arim (flood released from the dam), and We converted their two gardens into gardens producing bitter bad fruit, and tamarisks, and some few lote-trees.

source: ذلك جزيناهم بما كفروا وهل نجازي إلا الكفور
en: Like this We requited them because they were ungrateful disbelievers. And never do We requite in such a way except those who are ungrateful (disbelievers).

source: وجعلنا بينهم وبين القرى التي باركنا فيها قرى ظاهرة وقدرنا فيها السير سيروا فيها ليالي وأياما آمنين
en: And We placed, between them and the towns which We had blessed, towns easy to be seen, and We made the stages (of journey) between them easy (saying): "Travel in them safely both by night and day."

source: فقالوا ربنا باعد بين أسفارنا وظلموا أنفسهم فجعلناهم أحاديث ومزقناهم كل ممزق إن في ذلك لآيات لكل صبار شكور
en: But they said: "Our Lord! Make the stages between our journey longer," and they wronged themselves; so We made them as tales (in the land), and We dispersed them all totally. Verily, in this are indeed signs for every steadfast, grateful (person).
